app/controllers/reminders_controller.rb

  def show
    @reminder = Reminder.find(params[:id])
---
SELECT * FROM "reminders" WHERE ("reminders"."id" = 1034712272)

  def edit
    @reminder = Reminder.find(params[:id])
---
SELECT * FROM "reminders" WHERE ("reminders"."id" = 1034712272)

  def create
    @reminder = Reminder.new(params[:reminder].merge!(:user_id => current_user.id))

    if @reminder.valid?
      @reminder.save_with_update_user!
---
INSERT INTO "reminders" ("completed", "updated_at", "title", "body", "schedule_id", "user_id", "learned_at", "created_at", "next_learn_date") VALUES('f', '2009-01-31 02:23:57', 'fuge', 'agas', 115652042, 798280669, '2009-01-31', '2009-01-31 02:23:57', '2009-02-07')

  def update
    @reminder = Reminder.find(params[:id])

    @reminder.attributes = params[:reminder]

    if @reminder.valid?
      @reminder.save_with_update_user!
---
SELECT * FROM "reminders" WHERE ("reminders"."id" = 1034712274)
UPDATE "reminders" SET "schedule_id" = 115652042, "next_learn_date" = '2009-02-07', "updated_at" = '2009-01-31 04:49:50' WHERE "id" = 306916864

  def destroy
    @reminder = Reminder.find(params[:id])
    @reminder.destroy
---
SELECT * FROM "reminders" WHERE ("reminders"."id" = 1034712275)
DELETE FROM "reminders" WHERE "id" = 1034712275

  def list
    @reminder = Reminder.new(params[:reminder])
    @reminders ||= Reminder.lists(:user_id => reminder_user.id, :tag => params["tag"])
    if @reminder.search_word
      @reminders = @reminders.search(@reminder.search_word)
    end
    logger.debug{ "DEBUG(list) : @reminders = <#{@reminders.to_yaml}>" }
    @tags = Reminder.tag_counts(:conditions => ["reminders.id IN (?)", @reminders.map(&:id)])
---
SELECT * FROM "reminders" WHERE ("reminders"."user_id" = 798280669) ORDER BY 'created_at' DESC
SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN reminders ON reminders.id = taggings.taggable_id WHERE (((tags.name LIKE 'fuge' OR tags.name LIKE 'geho')) AND taggings.taggable_type = 'Reminder') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

  def check
    reminder = Reminder.find(params[:id])

    if reminder && reminder.update_learned!
---
SELECT * FROM "reminders" WHERE ("reminders"."id" = 891923360)
UPDATE "reminders" SET "schedule_id" = 115652041, "next_learn_date" = '2009-02-14', "updated_at" = '2009-01-31 02:00:46' WHERE "id" = 891923360